000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЗначенияДополнительныхПравПользователя/ЗначенияДополнительныхПравПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияДополнительныхПравПользователя</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ПраваПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Право</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ПраваПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/УправлениеДоступомСервер/Module.bsl
//	LNK 18.03.2019 09:38:47
Функция ПредоставитьАдминистраторПолномочный(Пользователь, Значение = Истина)	Экспорт

	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Право        = ПланыВидовХарактеристик.ПраваПользователей.АдминистраторПолномочный;
	МенеджерЗаписи.Значение     = Значение;

	МенеджерЗаписи.Записать();

	Возврат МенеджерЗаписи.Значение;

КонецФункции // ПредоставитьАдминистраторПолномочный()

//	LNK 03.02.2020 14:50:50
Функция ПредоставитьСкрытыйДоступ(Пользователь, Знач ПравоПользователя, Значение = Истина)	Экспорт

	Попытка

		Если ТипЗнч(ПравоПользователя) = Тип("Строка") Тогда

			ПравоПользователя = ПланыВидовХарактеристик.ПраваПользователей[ПравоПользователя];

		ИначеЕсли НЕ ТипЗнч(ПравоПользователя) = Тип("ПланВидовХарактеристикСсылка.ПраваПользователей") Тогда

			Возврат Ложь;

		КонецЕсли;

	Исключение

		Возврат Ложь;

	КонецПопытки;

	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьМенеджерЗаписи();

	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Право        = ПравоПользователя;
	МенеджерЗаписи.Значение     = Значение;

	МенеджерЗаписи.Записать();

	Возврат МенеджерЗаписи.Значение;

КонецФункции
